/**
  **********************************  STM8S  ***********************************
  * @文件名     ： global_variable.c
  * @作者       ： Huang Fugui
  * @库版本     ： V2.2.0
  * @文件版本   ： V1.0.0
  * @日期       ： 2016年09月02日
  * @摘要       ： 全局变量源文件
  ******************************************************************************/
/*----------------------------------------------------------------------------
  更新日志:
  2016-09-02 V1.0.0:初始版本
  ----------------------------------------------------------------------------*/
/* 包含的头文件 --------------------------------------------------------------*/
#include "global_variable.h"


/* 全局变量 ------------------------------------------------------------------*/
/* 串口 */
uint8_t  gRx_Buf[RXBUF_LEN];                               //串口接收数据BUF
uint8_t  gRx_Ok = FLAG_N_VALID;                            //数据包接收完成(有效)

/* 关于刷卡 */
uint8_t  gEeprom_Buf[4];                                   //数据BUF
uint16_t gCount;                                           //刷卡总次数
uint16_t gRecord_Offset;                                   //记录偏移

uint8_t  gDeviceID = 0;                                    //刷卡机(设备)编号

/* TIM定时器 */
uint8_t  gTIMTiming2_FlagOver = FLAG_N_VALID;              //定时2时间溢出标志
uint16_t gTIMTiming2_Num;                                  //定时2计数

/* 卡数据块 */
uint8_t  gCardBlock_Buf[16];                               //卡一块数据BUF

/* 卡ID号 */
uint8_t  gCardID[4];                                       //最后一次刷卡ID号

/* 定时器（计数超时） */
uint16_t gTiming_Card = 0;                                 //刷卡定时（防止两种相同卡重复操作）
uint16_t gTiming_Out = 0;                                  //输出定时（继电器输出）


/* 设备地址 */
uint8_t  gDeviceAddress;



/***** Copyright (C)2016 HuangFugui. All Rights Reserved ***** END OF FILE *****/
